Repository: almlys/sudoku
Catalog: *.po
Languages: ca, es

source: WxPython 2.6 or higher is required to run this application!!! You can get it from http://www.wxpython.org Or you can just type as root "apt-get install python-wxgtk2.6" on Debian, Ubuntu and any other Debian based distros On other distros you may try similar commands, yum, urpmi, emerge,..., just check your Distro documentation but if you don't have root access you will need to manually install wxPython in your home directory, have fun!
ca: Es requereix WxPython 2.6 o superior per poder executar l'aplicació!!! La pots obtenir de http://www.wxpython.org O pots escriure "apt-get install python-wxgtk2.6" com a root a Debian, Ubuntu i qualsevol altra distribució basada en Debian En altres distribucions pots triar comandes similars com yum, urpmi, emerge,.... Comprova la documentació de la teva distribució. Però si no tens accés de root, hauràs d'Instal·lar wxPython manualment al teu directori home.
es: ¡¡¡Necesitas WxPython 2.6 o superior para ejecutar la aplicación!!! Lo puedes obtener de http://www.wxpython.org O simplemente puedes escribir "apt-get install python-wxgtk2.6" en Debian, Ubuntu y qualquier otra distribución basada en Debian En otras distribuciones existen comandos similares como, yum, urpmi, emerge, etc.. Comprueba la documentación de tu distribución ¡Pero si no tienes acceso root, tendrás que instalarlo manualmente en tu directorio home

source: Creates a New Sudoku
ca: Crea un nou Sudoku
es: Crea un nuevo Sudoku

source: Opens a Sudoku
ca: Obre un Sudoku
es: Abre un Sudoku

source: Opens a Sudoku from a Web server
ca: Obre un Sudoku des d'un servidor web
es: Abre un Sudoku de un servidor Web

source: Saves a Sudoku
ca: Guarda un Sudoku
es: Guarda un Sudoku

source: The application terminates
ca: La aplicació termina
es: La aplicación termina

source: Solves the Sudoku (I thought that you were smart!)
ca: Soluciona el Sudoku
es: Soluciona el Sudoku

source: Goes back to the past, well, it undoes your latest mess
ca: Desfà l'última acció
es: Deshace la última acción

source: Redoes your latest undo
ca: Refà l'última acció desfeta
es: Rehace la última acción deshecha

source: It shows you some helpful information
ca: Mostra informació molt útil
es: Muestra información muy útil

source: Changes your app language to %s
ca: Canvia l'idioma de l'aplicació a %s
es: Cambia la aplicación al %s

source: It allows you to change the language
ca: Et permet canviar l'idioma
es: Te permite cambiar el idioma

source: Shows some documentation of how does work this thing
ca: Mostra documentació de com funciona aquesta cosa
es: Muestra documentación de como funciona esta cosa

source: Checks if you are running the latest version
ca: Comprova si esteu executant l'última versió
es: Comprueba si estas corriendo la última versión

source: I need to explain what does this thing do?
ca: Necessito explicar que fa açò?
es: ¿Tengo que explicar que hace esto?

source: Opens a Python Interactive console, It's that cool
ca: Obre una consola Python interactiva
es: Abre una consola Python interactiva

source: Gets a Hint
ca: Obté una pista
es: Obtiene una pista

source: &New...
ca: &Nou...
es: &Nuevo...

source: &Open...
ca: &Obrir...
es: &Abrir...

source: &Open URL...
ca: &Obrir adreça...
es: &Abrir URL...

source: &Exit
ca: Sortir
es: &Salir

source: &File
ca: &Fitxer
es: &Archivo

source: &Solve
ca: &Solucionar
es: &Solucionar

source: &Get Hint
ca: &Obtenir pista
es: &Obtener pista

source: &Undo
ca: &Desfer
es: &Deshacer

source: &Redo
ca: &Refer
es: Rehacer

source: &Show Hints
ca: &Mostrar pistes
es: &Mostrar Pistas

source: &Change Language
ca: &Canviar Idioma
es: &Cambia el Idioma

source: &Options
ca: &Opcions
es: &Opciones

source: &Console...
ca: &Consola...
es: &Consola...

source: &About...
ca: &Sobre...
es: &Acerca de...

source: &Help
ca: &Ajuda
es: A&yuda

source: New...
ca: Nou
es: Nuevo...

source: Open...
ca: Obrir
es: Abrir...

source: Solve
ca: Solucionar
es: Solucionar

source: Undo
ca: Desfer
es: Deshacer

source: Redo
ca: Refer
es: Rehacer

source: Show Hints
ca: Mostrar pistes
es: Mostrar Pistas

source: Get Hint
ca: Obtenir pista
es: Obtener pista

source: Are you really sure that you wish to quit?
ca: Esteu completament segurs de que voleu sortir?
es: ¿Estas completamente seguro que deseas salir?

source: Are you sure?
ca: Esteu segur de la seva decisió?
es: ¿Está usted seguro?

source: Creating Sudoku, please wait....
ca: Creant Sudoku, si us plau esperi...
es: Creando Sudoku, por favor espera...

source: GPE files
ca: Fitxers GPE
es: Ficheros GPE

source: TSudoku files
ca: Fitxers TSudoku
es: Ficheros TSudoku

source: All Files
ca: Tots els fitxers
es: Todos los ficheros

source: Opening %s, please wait...
ca: Obrint %s, si us plau esperi...
es: Abriendo %s, por favor espera...

source: Invalid sudoku file
ca: Fitxers Sudoku invalid
es: Fichero de Sudoku no válido

source: Malformed, unconsistent, or unexistent file. %s
ca: Fitxer mal formatat, inconsistent, o inexistent. %s
es: Fichero mal formado, inconsistente o inexistente. %s

source: Enter the URL
ca: Entra l'adreça URL
es: Introduce la dirección URL

source: The server said: %s Requesting the %s resource
ca: El servidor ha dit: %s Demanant el recurs %s
es: El servidor dijo: %s Solicitando el recurso %s

source: Remote server error
ca: Error remot del servidor
es: Error remoto del servidor

source: Cannot open %s, reason %s
ca: No puc obrir %s, raó %s
es: No puedo abrir %s, razón %s

source: Solving Sudoku, please wait....
ca: Solucionant Sudoku, si us plau esperi...
es: Solucionando Sudoku, por favor espera...

source: No solution has been found.
ca: No s'ha trobat cap solució
es: No se ha encontrado ninguna solución

source: I can't get a hint, because this Sudoku does not have any solution.
ca: No puc obtenir cap pista, perquè aquest Sudoku no te cap solució.
es: No puedo obtener una pista, porque este Sudoku no tiene ninguna solución

source: Launching Shell...
ca: Llançant Shell...
es: Lanzando Shell...

source: Failed launching shell, reason %s
ca: El llançament del Shell ha fracasat, raó %s
es: Falló el lanzamiento del shell, razón %s

source: File
ca: Fitxer
es: Archivo

source: Open URL...
ca: Obrir adreça...
es: Abrir URL...

source: Exit
ca: Sortir
es: Salir

source: Options
ca: Opcions
es: Opciones

source: Change Language
ca: Canviar Idioma
es: Cambia el Idioma

source: Help
ca: Ajuda
es: Ayuda

source: About...
ca: Sobre...
es: Acerca de...

source: Load
ca: Obrir
es: Cargar

source: English
ca: Anglès
es: Inglés

source: Spanish
ca: Espanyol
es: Español

source: Catalan
ca: Català
es: Catalán

source: Type
ca: Tipus
es: Tipo

source: Block Size
ca: Mida del bloc
es: Tamaño del bloque

source: Create New Sudoku
ca: Crea un nou Sudoku
es: Crea un nuevo Sudoku

source: Al's WxWidgets Python Sudoku. Another Sudoku solver, written 100%% in Python and wxWidgets. Version: %s Original Author: Copyright (c) 2006 Juan Manuel Gimeno Illa Current Author: Copyright (C) 2007 Alberto Montañola Lacort This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
ca: Al's WxWidgets Python Sudoku. Un altre solver de Sudoku, escrit 100%% en Python i wxWidgets. Versió: %s Autor Original: Copyright (c) 2006 Juan Manuel Gimeno Illa Autor Actual: Copyright (C) 2007 Alberto Montañola Lacort This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
es: Al's WxWidgets Python Sudoku. Otro solver de Sudoku, escrito 100%% en Python y wxWidgets. Versión: %s Autor Original: Copyright (c) 2006 Juan Manuel Gimeno Illa Autor Actual: Copyright (C) 2007 Alberto Montañola Lacort This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.

source: About %s
ca: Sobre %s
es: Acerca de %s
